Outline/CBE60553-outline.org
#+BEGIN_OPTIONS
#+AUTHOR: William F. Schneider
#+TITLE: CBE 60553 Outline
#+EMAIL: wschneider@nd.edu
#+LATEX_CLASS_OPTIONS: [11pt]
#+LATEX_HEADER:\usepackage{geometry}
#+LATEX_HEADER:\geometry{margin=1.0in}
#+LATEX_HEADER:\usepackage{outline}
#+LATEX_HEADER:\usepackage{amsmath}
#+LATEX_HEADER:\usepackage{graphicx}
#+LATEX_HEADER:\usepackage{epstopdf}
#+LATEX_HEADER:\usepackage{fancyhdr}
#+LATEX_HEADER:\usepackage{hyperref}
#+LATEX_HEADER:\usepackage[labelfont=bf]{caption}
#+LATEX_HEADER:\setlength{\headheight}{15.2pt}
#+LATEX_HEADER:\def\dbar{{\mathchar'26\mkern-12mu d}}
#+LATEX_HEADER:\pagestyle{fancy}
#+LATEX_HEADER:\fancyhf{}
#+LATEX_HEADER:\renewcommand{\headrulewidth}{0.5pt}
#+LATEX_HEADER:\renewcommand{\footrulewidth}{0.5pt}
#+LATEX_HEADER:\lfoot{\today}
#+LATEX_HEADER:\cfoot{\copyright\ 2017 W.\ F.\ Schneider}
#+LATEX_HEADER:\rfoot{\thepage}
#+LATEX_HEADER:\lhead{\em{Advanced Chemical Engineering Thermodynamics}}
#+LATEX_HEADER:\rhead{ND CBE 60553}

#+EXPORT_EXCLUDE_TAGS: noexport
#+OPTIONS: toc:nil
#+OPTIONS: H:3 num:3
#+OPTIONS: ':t
#+END_OPTIONS
* The Basic Structure of Thermodynamics
** Problems and Postulates
1. Many DOFs $\rightarrow$ few thermodynamic variables
2. Extensive variables: $V$, $N$, $U$
3. Conservation of energy (kinetic, potential, mass, light, ...)
   1. Consequence of time-reversal symmetry

4. *Postulate 1*: The "equilibrium" states of simple and homogeneous
   systems are fully characterized by $U$, $V$, $N_j$
   1. Examples

5. Definitions
   1. System and environment
   2. Walls - permeable and impermeable; adiabatic and diathermal

6. Work and heat - inexact differentials, path dependent

7. Internal energy $dU = \dbar q + \dbar W$

8. Mechanical measurement of energy, work $W = - \int P_{\rm ext} dV$

9. Processes - Spontaneous, quasi-static, reversible

10. *Postulate 2*: A state function entropy $S$ exists and is maximized at equilibrium
    1. The "fundamental" equation

11. *Postulate 3*: $S$ is a nice, extensive, homogeneous function, monotonically increasing in $U$, $\partial S/\partial U \geq 0$

12. *Postulate 4*: Entropy vanishes at $T = 0$, third law of thermodynamics

13. Three overarching questions:
    1. Characterize thermodynamic equilibrium state of a system (gas, liquid, interface, ...)
    2. Determine new equilibrium state when a constraint is removed
    3. Determine (path dependent) effect on environment of moving between two equilibrium states.
    4. /Bonus problem/: Relate macroscopic to microscopic behavior

14. Impossible, reversible, quasi-static, and real processes

** Interlude: Multivariate calculus
1. Partial derivatives
2. State functions and exact differentials: \(df =\left (
       \frac{\partial f}{\partial x} \right )_y dx + \left (
       \frac{\partial f}{\partial y} \right )_x dy\)
3. Fun with partial differentials
     \begin{equation*}
      \left ( \frac{\partial f}{\partial x} \right )_y    \left ( \frac{\partial
          x}{\partial y} \right )_f    \left ( \frac{\partial y}{\partial f} \right )_x =
      -1 \ \ \ \ \ \ \    \left ( \frac{\partial f}{\partial x} \right )_y  =   \left (
	\frac{\partial x}{\partial f} \right )_y^{-1}  \ \ \ \ \ \ \    \left (
	\frac{\partial f}{\partial x} \right )_y  =   \left ( \frac{\partial f}{\partial t}
      \right )_y  /   \left ( \frac{\partial x}{\partial t} \right )_y
     \end{equation*}

4. Homogeneous functions of order $n$: $f(\lambda x, \lambda y ) = \lambda^n f(x,y)$
   1. Thermodynamic state functions (extensive quantities) are homogeneous order 1
   2. First derivatives (intensive quantities) are homogeneous order 0
5. Euler relation: \( =\left (
       \frac{\partial f}{\partial x} \right )_y x + \left (
       \frac{\partial f}{\partial y} \right )_x y\)

** Calculus of energy, entropy, and equilibrium
1. $U = U(S,V,N)$ state function (Table~\ref{table:potentials})
   1. Molar state function $u(s,v)= U(S/N,V/N,1)/N$
2. Partial derivatives of $U$: intensive variables temperature, pressure, and chemical potential
3. Equations of state relate intensive variables
4. Euler relation
5. Entropy representation $S = S(U,V,N)$, $s=s(u,v)$
6. Thermal, mechanical, chemical equilibrium determined by equality of $T$, $P$, $\mu_i$
7. Gibbs-Duhem relationship between intensive variables
   1. \(SdT -VdP+\sum_i N_id\mu_i=0\)

#+BEGIN_EXPORT LaTeX
\begin{table}
  \begin{center}
  \caption{Thermodynamic Potentials} \label{table:potentials}
  \begin{tabular}{ll}
\hline
    $U = U(S,V,N)$ & $dU = \left ( \dfrac{\partial U}{\partial S} \right )_{V,N}
    dS + \left ( \dfrac{\partial
      U}{\partial V}\right )_{S,N} dV + \sum \left (
      \dfrac{\partial U}{\partial N_i} \right )_{S,V} dN_i$  \\ \\
 & $dU = T dS -P dV + \sum \mu_i dN_i $\\ \\
 & $U =TS -PV +\sum \mu N $  \\ \\
  \hline
    $S = S(U,V,N)$ & $dS = \left ( \dfrac{\partial S}{\partial U} \right )_{V,N}
    dU + \left ( \dfrac{\partial
      S}{\partial V}\right )_{U,N} dV + \sum \left (
      \dfrac{\partial S}{\partial N_i} \right )_{U,V} dN_i$  \\ \\
 & $dS = \dfrac{1}{T} dU + \dfrac{P}{T} dV - \sum \dfrac{ \mu_i}{T} dN_i $\\ \\
 & $S = U/T + PV/T +\sum \mu_i N_i/T $  \\ \\
\hline
    $H = H(S,P,N)$ & $H = U + PV$ \\ \\
  & $dH = \left ( \dfrac{\partial H}{\partial S} \right )_{P,N}
    dS + \left ( \dfrac{\partial
      H}{\partial P}\right )_{S,N} dP + \sum \left (
      \dfrac{\partial H}{\partial N_i} \right )_{S,P} dN_i$  \\ \\
 & $dH = T dS + V dP + \sum  \mu_i dN_i $\\ \\
 & $H = TS +\sum \mu_i N_i $  \\ \\
\hline
    $F = F(T,V,N)$ & $F = U - TS$ \\ \\
  & $dF = \left ( \dfrac{\partial F}{\partial T} \right )_{V,N}
    dT + \left ( \dfrac{\partial
      F}{\partial V}\right )_{T,N} dV + \sum \left (
      \dfrac{\partial F}{\partial N_i} \right )_{T,V} dN_i$  \\ \\
 & $dF = -S dT -P dV + \sum  \mu_i dN_i $\\ \\
 & $F = PV +\sum \mu_i N_i $  \\ \\
\hline
    $G = G(T,P,N)$ & $G = U - TS + PV$ \\ \\
  & $dG = \left ( \dfrac{\partial G}{\partial T} \right )_{P,N}
    dT + \left ( \dfrac{\partial
      G}{\partial P}\right )_{T,N} dP + \sum \left (
      \dfrac{\partial G}{\partial N_i} \right )_{T,P} dN_i$  \\ \\
 & $dG = -S dT + V dP + \sum  \mu_i dN_i $\\ \\
 & $G = \sum \mu_i N_i $  \\ \\
\hline
  \end{tabular}
  \end{center}
\end{table}

#+END_EXPORT

** Ideal and van der Waals gases
1. Ideal gas EOS $Pv=RT$, $u=cRT$
   1. Integrate \( ds = du/cru + dv/rv \)
   2. Fundamental equation \(s(u,v)=cR \ln(u/u_0)+R  \ln (v/v_0) + s_0(u_0,v_0)\)

2. Generalized ideal gas
   1. $Pv=RT$ and \(u(T) = u_0 + \int_{T_0}^T c_v^*(T) dT\)
   2. \(\kappa_{\rm T} = 1/P\), \(\alpha=1/T\), \(c_p^*=c_v^*+R\)

3. Isothermal process ($\Delta T=0$)
   1. Ideal gas: $\Delta u = 0$, \(\Delta s = R \ln(v/v_0)\), \(q_\text{QS}=RT \ln(v/v_0)=-w_\text{QS}\)
4. Adiabatic ($\Delta s=0$) processes
   1. Ideal gas adiabats ($\gamma=(c+1)/c$): $P v^\gamma = c$, $T v^{\gamma-1}=c'$, $P^{(1-\gamma)/\gamma}T  = c''$
   2. $w_\text{QS}=R T_0 \left [ 1-(v/v_0)^{1-\gamma} \right ]/(1-\gamma)$, $q_\text{QS}=0$
5. Free expansion: heat but no light!

6. van der Waals gas
   1. $P_\text{vdW}=RT/(v-b) - a/v^2$ and $u = cRT - a/v$
   2. Fundamental equation $s(u,v)=cR \ln((u+a/v)/(u_0+a/v_0))+R  \ln ((v-b)/(v_0-b)) + s_0(u_0,v_0)$
   3. Simplest "cubic" EOS that gives qualitatively correct fluid properties
      1. Coexistent of two phases
      2. Critical point ($T_c$, $P_c$, $v_c$) where two phases coalesce into one

