Outline/CBE60553-outline.tex
% Created 2017-08-20 Sun 16:28
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage{lmodern}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage[version=3]{mhchem}
\usepackage[numbers,super,sort&compress]{natbib}
\usepackage{natmove}
\usepackage{url}
\usepackage{minted}
\usepackage{underscore}
\usepackage[linktocpage,pdfstartview=FitH,colorlinks,
linkcolor=blue,anchorcolor=blue,
citecolor=blue,filecolor=blue,menucolor=blue,urlcolor=blue]{hyperref}
\usepackage{attachfile}
\usepackage{geometry}
\geometry{margin=1.0in}
\usepackage{outline}
\usepackage{amsmath}
\usepackage{graphicx}
\usepackage{epstopdf}
\usepackage{fancyhdr}
\usepackage{hyperref}
\usepackage[labelfont=bf]{caption}
\setlength{\headheight}{15.2pt}
\def\dbar{{\mathchar'26\mkern-12mu d}}
\pagestyle{fancy}
\fancyhf{}
\renewcommand{\headrulewidth}{0.5pt}
\renewcommand{\footrulewidth}{0.5pt}
\lfoot{\today}
\cfoot{\copyright\ 2017 W.\ F.\ Schneider}
\rfoot{\thepage}
\lhead{\em{Advanced Chemical Engineering Thermodynamics}}
\rhead{ND CBE 60553}
\setcounter{secnumdepth}{3}
\author{William F. Schneider}
\date{\today}
\title{CBE 60553 Outline}
\begin{document}

\begin{OPTIONS}
\end{OPTIONS}
\section{The Basic Structure of Thermodynamics}
\label{sec:orgebbdda2}
\subsection{Problems and Postulates}
\label{sec:org0715c71}
\begin{enumerate}
\item Many DOFs \(\rightarrow\) few thermodynamic variables
\item Extensive variables: \(V\), \(N\), \(U\)
\item Three overarching questions:
\begin{enumerate}
\item Characterize thermodynamic equilibrium state of a system
\item Determine differences in thermodynamic quantities between two
states, and corresponding effect on environment
\item Determine equilibrium state when a constraint is removed
\item \emph{Bonus problem}: Relate macroscopic to microscopic behavior
\end{enumerate}

\item Conservation of energy
\item \textbf{Postulate 1}: Equilibrium states exist
\begin{enumerate}
\item Examples
\end{enumerate}

\item Definitions
\begin{enumerate}
\item System and environment
\item Walls - permeable and impermeable; adiabatic and diathermal
\item Processes - Spontaneous, quasi-static, reversible
\end{enumerate}

\item Work and heat - inexact differentials, path dependent
\item Internal energy \(dU = \dbar q + \dbar W\)
\item Mechanical measurement of energy, work \(W = - \int P_{\rm ext} dV\)

\item \textbf{Postulate 2}: A state function entropy \(S\) exists and is maximized at equilibrium
\begin{enumerate}
\item The ``fundamental'' equation
\end{enumerate}

\item \textbf{Postulate 3}: \(S\) is a nice, extensive, homogeneous function, monotonically increasing in \(U\), \(\partial S/\partial U \geq 0\)

\item \textbf{Postulate 4}: Entropy vanishes at \(T = 0\), third law of thermodynamics
\item Impossible, reversible, quasi-static, and real processes
\end{enumerate}

\subsection{Interlude: Multivariate calculus}
\label{sec:orgd0244fb}
\begin{enumerate}
\item Partial derivatives
\item State functions and exact differentials: \(df =\left (
       \frac{\partial f}{\partial x} \right )_y dx + \left (
       \frac{\partial f}{\partial y} \right )_x dy\)
\item Fun with partial differentials
\begin{equation*}
 \left ( \frac{\partial f}{\partial x} \right )_y    \left ( \frac{\partial
     x}{\partial y} \right )_f    \left ( \frac{\partial y}{\partial f} \right )_x =
 -1 \ \ \ \ \ \ \    \left ( \frac{\partial f}{\partial x} \right )_y  =   \left (
   \frac{\partial x}{\partial f} \right )_y^{-1}  \ \ \ \ \ \ \    \left (
   \frac{\partial f}{\partial x} \right )_y  =   \left ( \frac{\partial f}{\partial t}
 \right )_y  /   \left ( \frac{\partial x}{\partial t} \right )_y
\end{equation*}

\item Homogeneous functions of order \(n\): \(f(\lambda x, \lambda y ) = \lambda^n f(x,y)\)
\begin{enumerate}
\item Thermodynamic state functions (extensive quantities) are homogeneous order 1
\item First derivatives (intensive quantities) are homogeneous order 0
\end{enumerate}
\item Euler relation: \(=\left (
       \frac{\partial f}{\partial x} \right )_y x + \left (
       \frac{\partial f}{\partial y} \right )_x y\)
\end{enumerate}

\subsection{Calculus of energy, entropy, and equilibrium}
\label{sec:org651e0ea}
\begin{enumerate}
\item \(U = U(S,V,N)\) state function (Table\textasciitilde{}\ref{table:potentials})
\begin{enumerate}
\item Molar state function \(u(s,v)= U(S/N,V/N,1)/N\)
\end{enumerate}
\item Partial derivatives of \(U\): intensive variables temperature, pressure, and chemical potential
\item Equations of state relate intensive variables
\item Euler relation
\item Entropy representation \(S = S(U,V,N)\), \(s=s(u,v)\)
\item Thermal, mechanical, chemical equilibrium determined by equality of \(T\), \(P\), \(\mu_i\)
\item Gibbs-Duhem relationship between intensive variables
\begin{enumerate}
\item \(SdT -VdP+\sum_i N_id\mu_i=0\)
\end{enumerate}
\end{enumerate}

\begin{table}
  \begin{center}
  \caption{Thermodynamic Potentials} \label{table:potentials}
  \begin{tabular}{ll}
\hline
    $U = U(S,V,N)$ & $dU = \left ( \dfrac{\partial U}{\partial S} \right )_{V,N}
    dS + \left ( \dfrac{\partial
      U}{\partial V}\right )_{S,N} dV + \sum \left (
      \dfrac{\partial U}{\partial N_i} \right )_{S,V} dN_i$  \\ \\
 & $dU = T dS -P dV + \sum \mu_i dN_i $\\ \\
 & $U =TS -PV +\sum \mu N $  \\ \\
  \hline
    $S = S(U,V,N)$ & $dS = \left ( \dfrac{\partial S}{\partial U} \right )_{V,N}
    dU + \left ( \dfrac{\partial
      S}{\partial V}\right )_{U,N} dV + \sum \left (
      \dfrac{\partial S}{\partial N_i} \right )_{U,V} dN_i$  \\ \\
 & $dS = \dfrac{1}{T} dU + \dfrac{P}{T} dV - \sum \dfrac{ \mu_i}{T} dN_i $\\ \\
 & $S = U/T + PV/T +\sum \mu_i N_i/T $  \\ \\
\hline
    $H = H(S,P,N)$ & $H = U + PV$ \\ \\
  & $dH = \left ( \dfrac{\partial H}{\partial S} \right )_{P,N}
    dS + \left ( \dfrac{\partial
      H}{\partial P}\right )_{S,N} dP + \sum \left (
      \dfrac{\partial H}{\partial N_i} \right )_{S,P} dN_i$  \\ \\
 & $dH = T dS + V dP + \sum  \mu_i dN_i $\\ \\
 & $H = TS +\sum \mu_i N_i $  \\ \\
\hline
    $F = F(T,V,N)$ & $F = U - TS$ \\ \\
  & $dF = \left ( \dfrac{\partial F}{\partial T} \right )_{V,N}
    dT + \left ( \dfrac{\partial
      F}{\partial V}\right )_{T,N} dV + \sum \left (
      \dfrac{\partial F}{\partial N_i} \right )_{T,V} dN_i$  \\ \\
 & $dF = -S dT -P dV + \sum  \mu_i dN_i $\\ \\
 & $F = PV +\sum \mu_i N_i $  \\ \\
\hline
    $G = G(T,P,N)$ & $G = U - TS + PV$ \\ \\
  & $dG = \left ( \dfrac{\partial G}{\partial T} \right )_{P,N}
    dT + \left ( \dfrac{\partial
      G}{\partial P}\right )_{T,N} dP + \sum \left (
      \dfrac{\partial G}{\partial N_i} \right )_{T,P} dN_i$  \\ \\
 & $dG = -S dT + V dP + \sum  \mu_i dN_i $\\ \\
 & $G = \sum \mu_i N_i $  \\ \\
\hline
  \end{tabular}
  \end{center}
\end{table}

\subsection{Ideal and van der Waals gases}
\label{sec:org70fd02a}
\begin{enumerate}
\item Ideal gas EOS \(Pv=RT\), \(u=cRT\)
\begin{enumerate}
\item Fundamental equation \(s(u,v)=cR \ln(u/u_0)+R  \ln (v/v_0) + s_0(u_0,v_0)\)
\end{enumerate}

\item Generalized ideal gas
\begin{enumerate}
\item \(Pv=RT\) and \(u(T) = u_0 + \int_{T_0}^T c_v^*(T) dT\)
\item \(\kappa_{\rm T} = 1/P\), \(\alpha=1/T\), \(c_p^*=c_v^*+R\)
\end{enumerate}

\item Isothermal process (\(\Delta T=0\))
\begin{enumerate}
\item Ideal gas: \(\Delta u = 0\), \(\Delta s = R \ln(v/v_0)\), \(q_\text{QS}=RT \ln(v/v_0)=-w_\text{QS}\)
\end{enumerate}
\item Adiabatic (\(\Delta s=0\)) processes
\begin{enumerate}
\item Ideal gas adiabats (\(\gamma=(c+1)/c\)): \(P v^\gamma = c\), \(T v^{\gamma-1}=c'\), \(P^{(1-\gamma)/\gamma}T  = c''\)
\item \(w_\text{QS}=R T_0 \left [ 1-(v/v_0)^{1-\gamma} \right ]/(1-\gamma)\), \(q_\text{QS}=0\)
\end{enumerate}
\item Free expansion: heat but no light!
\item van der Waals gas
\begin{enumerate}
\item \(P_\text{vdW}=RT/(v-b) - a/v^2\) and \(u = cRT - a/v\)
\item Fundamental equation \(s(u,v)=cR \ln((u+a/v)/(u_0+a/v_0))+R  \ln ((v-b)/(v_0-b)) + s_0(u_0,v_0)\)
\item Simplest ``cubic'' EOS that gives qualitatively correct fluid properties
\begin{enumerate}
\item Coexistent of two phases
\item Critical point (\(T_c\), \(P_c\), \(v_c\)) where two phases coalesce into one
\end{enumerate}
\end{enumerate}
\end{enumerate}
