Outline/CBE60553-outline.org
** Work and efficiency
1. Maximum work theorem: maximum work is delivered by a process that overall
  produces zero entropy
  1. $dU_\text{sys}+\dbar q_\text{rhs} +\dbar w_\text{rws} =0$,
    $dS_\text{sys} + dS_\text{rhs}=dS_\text{sys} + \dbar q_\text{rhs}/T_\text{rhs}=0$
  2. Tells us what is possible, not how to achieve it!
2. Examples: expansion with a low $T$ reservoir, separation, cooling water
3. Thermodynamic engines operate cyclically to convert heat to work or use work to move heat
4. Carnot efficiency and Carnot cycle, $\eta =1 - T_c/T_h$

** Other thermodynamic potentials
  1. Energy minimum principle minimum at constant entropy
  2. Legendre transforms
     1. $Y=Y(X) \rightarrow \psi(P) = Y(P)-PX(P) \quad P=\partial Y /\partial X$
     2. $P,\psi(P)$ give intercept and slope of tangents of $Y$
  3. Enthalpy $H(S,P,N) = U + PV$
     1. Minimized at constant $S$, $P$, and $N$
     2. Heat flow when only $PV$ work done
  4. Helmholtz $A(T,V,N) = U - TS$
     1. Minimized at constant $T$, $V$, and $N$
     2. Maximum useful work from a process at temperature $T$
  5. Gibbs $G(T,P,N) = U + PV - TS$
     1. Minimized at constant $T$, $P$, and $N$
     2. Most useful for chemical problems
     3. Gibbs-Helmholtz \(\left ( \dfrac{\partial (G/T)}{\partial T} \right )_{P,N} = -\dfrac{H}{T^2}\)
  6. Alles potential
     1. Gibbs-Duhem redux
  7. Maxwell relations, see Table\nbsp{}\ref{Maxwell}.
  8. Three unique susceptibilities of a one-component material (Table\nbsp{}\ref{susceptibilities})
     1. All thermodynamic properties can be described in terms of the susceptibilities
     2. Integrating susceptibilities
     3. Heat capacity and departure functions
  9. Using thermodynamic relations
     1. Joule-Thompson effect
#+BEGIN_EXPORT LaTeX
\begin{table}
  \begin{center}
  \caption{\label{Maxwell}Useful Maxwell Relationships}
  \begin{tabular}{ccc}
\hline
Enthalpy   & Helmholtz & Gibbs \\
 & & \\
$ \left ( \dfrac{\partial T}{\partial P}\right )_S =  \left ( \dfrac{\partial V}{\partial
    S}\right )_P  $ &
$ \left ( \dfrac{\partial S}{\partial V}\right )_T =  \left ( \dfrac{\partial P}{\partial
    T}\right )_S  $ &
$ \left ( \dfrac{\partial S}{\partial P}\right )_T =  -\left ( \dfrac{\partial V}{\partial
    T}\right )_P  $ \\
\hline
  \end{tabular}
  \end{center}
\end{table}
#+END_EXPORT
#+BEGIN_EXPORT LaTeX
\begin{table}
  \begin{center}
  \caption{\label{susceptibilities}Susceptibilities}
  \begin{tabular}{cccc}
\hline
    Coefficient of thermal expansion & $\alpha$ &  $\dfrac{1}{v} \left (
      \dfrac{\partial v}{\partial T} \right )_P$  & $\dfrac{1}{v} \left (
      \dfrac{\partial^2 g}{\partial T \partial P} \right )_N$\\
  Isothermal compressibility   & $\kappa_T$  & $-\dfrac{1}{v} \left (
      \dfrac{\partial v}{\partial P} \right )_T$ & $-\dfrac{1}{v} \left (
      \dfrac{\partial^2 g}{\partial P^2} \right )_{T,N}$\\
  Constant  pressure heat capacity & $C_p$ & $ T \left ( \dfrac{\partial
      s}{\partial T}\right )_P $ & $-T \left (
      \dfrac{\partial^2 g}{\partial T^2} \right )_{P,N}$\\
  Constant  volume heat capacity & $C_v$ & $ T \left ( \dfrac{\partial
      s}{\partial T}\right )_v $ & \\
\hline
  \end{tabular}
  \end{center}
\end{table}
#+END_EXPORT

** Stability and phase equilibria
1. Local stability condition
   1. (Free) energy minimized $dU=0\quad d^2U \geq 0$
   2. Entropy maximized $dS = 0\quad d^2S \leq 0$
   3. Implies \(c_p \geq c_v \geq 0\), \(\kappa_T \geq \kappa_s \geq 0\)
   4. Microscopic fluctuations and Le'Chatlier's principle

2. Global stability conditions
   1. Common tangents and convex hull
   2. Lever rule
   3. Phase separation---two phases have lower free energy
      than one.  Balance of energetic attractions and entropic ``repulsion''
   4. Critical points ($d^3u = 0$) attraction and repulsion
      exactly in balance
   5. Stable, metastable (spinodal), and unstable regions
      1. Extensive quantities discontinuous between phases (``latent'' quantities)
      2. Intensive quantities equal between phases
      3. Susceptibilities discontinuous between phases

3. Gibbs-Duhem integrations
4. Equal area construction, $d\mu = vdP$ along an isotherm
5. $d\mu = - s dT$, chemical potential of each phase decreases with $T$
6. Phase diagrams---lines of equal chemical potential, $\mu(l)=\mu(v)$
7. Clausius equation
   1. Along coexistence line $dP/dT = \Delta s/\Delta v = \Delta
      h/T\Delta v$ in general
   2. Clausius-Clapeyron for ideal vapor $d\ln P/d(1/T) = -\Delta h/R$

8. Gibb's phase rule and triple point
   1. $DOF = c -\pi - R + 2$

* The Microscopic View
** Micro-canonical ensemble
*** Energy is /quantized/ at microscopic level
1. Consequence of quantum mechanics
2. electronic, vibrational, rotational, translational
3. Need machinary to average QM information over macroscopic systems
4. Equal /a priori/ probabilities
*** Two-state model
1. Box of particles, each of which can have energy 0 or $\epsilon$
2. Thermodynamic state defined by number of elements $N$, and number of
   quanta $q$, $U=q\epsilon$
3. Degeneracy of given $N$ and $q$ given by binomial distribution:
   \begin{displaymath}
     \Omega=\frac{N!}{q!(N-q)!}
   \end{displaymath}
4. Allow energy to flow between two such systems
 1. Energy of a closed system is conserved (first law!)
 2. Degeneracy of total system is always $\geq$ degeneracy of the
     starting parts!
 3. Boltzmann's tombstone, $S = k_B \ln \Omega$
 4. Clausius: entropy of the universe seeks a maximum!  Second Law...
5. Energy flow/thermal equilibrium between two large systems
   1. Each subsystem has energy $U_i$ and degeneracy $\Omega_i(U_i)$
   2. Bring in thermal contact, $U=U_1+U_2$, $\Omega=\Omega_1(U_1)\Omega_2(U_2)$
   3. If systems are very large, one combination of $U_1$, $U_2$ and $\Omega$
      will be much more probably than all others
   4. What value of $U_1$ and $U_2=U-U_1$ maximizes $\Omega$?
\begin{displaymath}
 \left ( \frac{\partial \ln \Omega_1}{\partial U_1} \right )_N = \left ( \frac{\partial \ln \Omega_2}{\partial U_2} \right )_N
\end{displaymath}
\begin{displaymath}
 \left ( \frac{\partial S_1}{\partial U_1} \right )_N = \left ( \frac{\partial S_2}{\partial U_2} \right )_N
\end{displaymath}
6. Thermal equilibrium is determined by equal *temperature!*
        \begin{displaymath}
            \frac{1}{T}=\left ( \frac{\partial S}{\partial U} \right )_N
          \end{displaymath}
 1. When the temperatures of the two subsystems are equal, the
            entropy of the combined system is maximized!
 2. (Same arguments lead to requirement that equal pressures ($P_i$) and
            equal chemical potentials ($\mu_i$) maximize entropy when volumes or
            particles are exchanged)

*** Two-state model in limit of large $N$
1. Large $N$ and Stirling's approximation
2. Fundamental thermodynamic equation of two-state system:
        \begin{displaymath}
          S(U)=-k_B \left ( x \ln x + (1-x) \ln (1-x) \right ), \mathrm{where}\
          x = q/N = U/N\epsilon
        \end{displaymath}
3. Temperature is derivative of entropy wrt energy yields
          \begin{displaymath}
            U(T) = \frac{N\epsilon}{1+e^{\epsilon/k_BT}}
          \end{displaymath}
   1. $T \rightarrow 0, U \rightarrow 0, S \rightarrow 0$, minimum disorder
   2. $T \rightarrow \infty, U \rightarrow N\epsilon/2, S \rightarrow
              k_B \ln 2$, maximum disorder
4. Differentiate again to get heat capacity

** Canonical ensemble
