Outline/CBE60553-outline.tex

\subsection{Work and efficiency}
\label{sec:org2f9ea9c}
\begin{enumerate}
\item Maximum work theorem: maximum work is delivered by a process that overall
produces zero entropy
\begin{enumerate}
\item \(dU_\text{sys}+\dbar q_\text{rhs} +\dbar w_\text{rws} =0\),
\(dS_\text{sys} + dS_\text{rhs}=dS_\text{sys} + \dbar q_\text{rhs}/T_\text{rhs}=0\)
\item Tells us what is possible, not how to achieve it!
\end{enumerate}
\item Examples: expansion with a low \(T\) reservoir, separation, cooling water
\item Thermodynamic engines operate cyclically to convert heat to work or use work to move heat
\item Carnot efficiency and Carnot cycle, \(\eta =1 - T_c/T_h\)
\end{enumerate}

\subsection{Other thermodynamic potentials}
\label{sec:org962fa56}
\begin{enumerate}
\item Energy minimum principle minimum at constant entropy
\item Legendre transforms
\begin{enumerate}
\item \(Y=Y(X) \rightarrow \psi(P) = Y(P)-PX(P) \quad P=\partial Y /\partial X\)
\item \(P,\psi(P)\) give intercept and slope of tangents of \(Y\)
\end{enumerate}
\item Enthalpy \(H(S,P,N) = U + PV\)
\begin{enumerate}
\item Minimized at constant \(S\), \(P\), and \(N\)
\item Heat flow when only \(PV\) work done
\end{enumerate}
\item Helmholtz \(A(T,V,N) = U - TS\)
\begin{enumerate}
\item Minimized at constant \(T\), \(V\), and \(N\)
\item Maximum useful work from a process at temperature \(T\)
\end{enumerate}
\item Gibbs \(G(T,P,N) = U + PV - TS\)
\begin{enumerate}
\item Minimized at constant \(T\), \(P\), and \(N\)
\item Most useful for chemical problems
\item Gibbs-Helmholtz \(\left ( \dfrac{\partial (G/T)}{\partial T} \right )_{P,N} = -\dfrac{H}{T^2}\)
\end{enumerate}
\item Alles potential
\begin{enumerate}
\item Gibbs-Duhem redux
\end{enumerate}
\item Maxwell relations, see Table~\ref{Maxwell}.
\item Three unique susceptibilities of a one-component material (Table~\ref{susceptibilities})
\begin{enumerate}
\item All thermodynamic properties can be described in terms of the susceptibilities
\item Integrating susceptibilities
\item Heat capacity and departure functions
\end{enumerate}
\item Using thermodynamic relations
\begin{enumerate}
\item Joule-Thompson effect
\end{enumerate}
\end{enumerate}
\begin{table}
  \begin{center}
  \caption{\label{Maxwell}Useful Maxwell Relationships}
  \begin{tabular}{ccc}
\hline
Enthalpy   & Helmholtz & Gibbs \\
 & & \\
$ \left ( \dfrac{\partial T}{\partial P}\right )_S =  \left ( \dfrac{\partial V}{\partial
    S}\right )_P  $ &
$ \left ( \dfrac{\partial S}{\partial V}\right )_T =  \left ( \dfrac{\partial P}{\partial
    T}\right )_S  $ &
$ \left ( \dfrac{\partial S}{\partial P}\right )_T =  -\left ( \dfrac{\partial V}{\partial
    T}\right )_P  $ \\
\hline
  \end{tabular}
  \end{center}
\end{table}
\begin{table}
  \begin{center}
  \caption{\label{susceptibilities}Susceptibilities}
  \begin{tabular}{cccc}
\hline
    Coefficient of thermal expansion & $\alpha$ &  $\dfrac{1}{v} \left (
      \dfrac{\partial v}{\partial T} \right )_P$  & $\dfrac{1}{v} \left (
      \dfrac{\partial^2 g}{\partial T \partial P} \right )_N$\\
  Isothermal compressibility   & $\kappa_T$  & $-\dfrac{1}{v} \left (
      \dfrac{\partial v}{\partial P} \right )_T$ & $-\dfrac{1}{v} \left (
      \dfrac{\partial^2 g}{\partial P^2} \right )_{T,N}$\\
  Constant  pressure heat capacity & $C_p$ & $ T \left ( \dfrac{\partial
      s}{\partial T}\right )_P $ & $-T \left (
      \dfrac{\partial^2 g}{\partial T^2} \right )_{P,N}$\\
  Constant  volume heat capacity & $C_v$ & $ T \left ( \dfrac{\partial
      s}{\partial T}\right )_v $ & \\
\hline
  \end{tabular}
  \end{center}
\end{table}

\subsection{Stability and phase equilibria}
\label{sec:org7c6b8aa}
\begin{enumerate}
\item Local stability condition
\begin{enumerate}
\item (Free) energy minimized \(dU=0\quad d^2U \geq 0\)
\item Entropy maximized \(dS = 0\quad d^2S \leq 0\)
\item Implies \(c_p \geq c_v \geq 0\), \(\kappa_T \geq \kappa_s \geq 0\)
\item Microscopic fluctuations and Le'Chatlier's principle
\end{enumerate}

\item Global stability conditions
\begin{enumerate}
\item Common tangents and convex hull
\item Lever rule
\item Phase separation---two phases have lower free energy
than one.  Balance of energetic attractions and entropic ``repulsion''
\item Critical points (\(d^3u = 0\)) attraction and repulsion
exactly in balance
\item Stable, metastable (spinodal), and unstable regions
\begin{enumerate}
\item Extensive quantities discontinuous between phases (``latent'' quantities)
\item Intensive quantities equal between phases
\item Susceptibilities discontinuous between phases
\end{enumerate}
\end{enumerate}

\item Gibbs-Duhem integrations
\item Equal area construction, \(d\mu = vdP\) along an isotherm
\item \(d\mu = - s dT\), chemical potential of each phase decreases with \(T\)
\item Phase diagrams---lines of equal chemical potential, \(\mu(l)=\mu(v)\)
\item Clausius equation
\begin{enumerate}
\item Along coexistence line \(dP/dT = \Delta s/\Delta v = \Delta
      h/T\Delta v\) in general
\item Clausius-Clapeyron for ideal vapor \(d\ln P/d(1/T) = -\Delta h/R\)
\end{enumerate}

\item Gibb's phase rule and triple point
\begin{enumerate}
\item \(DOF = c -\pi - R + 2\)
\end{enumerate}
\end{enumerate}

\section{The Microscopic View}
\label{sec:org3e8b3d6}
\subsection{Micro-canonical ensemble}
\label{sec:org6cf7404}
\subsubsection{Energy is \emph{quantized} at microscopic level}
\label{sec:org569e67f}
\begin{enumerate}
\item Consequence of quantum mechanics
\item electronic, vibrational, rotational, translational
\item Need machinary to average QM information over macroscopic systems
\item Equal \emph{a priori} probabilities
\end{enumerate}
\subsubsection{Two-state model}
\label{sec:orgc1b4c3e}
\begin{enumerate}
\item Box of particles, each of which can have energy 0 or \(\epsilon\)
\item Thermodynamic state defined by number of elements \(N\), and number of
quanta \(q\), \(U=q\epsilon\)
\item Degeneracy of given \(N\) and \(q\) given by binomial distribution:
\begin{displaymath}
  \Omega=\frac{N!}{q!(N-q)!}
\end{displaymath}
\item Allow energy to flow between two such systems
\begin{enumerate}
\item Energy of a closed system is conserved (first law!)
\item Degeneracy of total system is always \(\geq\) degeneracy of the
starting parts!
\item Boltzmann's tombstone, \(S = k_B \ln \Omega\)
\item Clausius: entropy of the universe seeks a maximum!  Second Law\ldots{}
\end{enumerate}
\item Energy flow/thermal equilibrium between two large systems
\begin{enumerate}
\item Each subsystem has energy \(U_i\) and degeneracy \(\Omega_i(U_i)\)
\item Bring in thermal contact, \(U=U_1+U_2\), \(\Omega=\Omega_1(U_1)\Omega_2(U_2)\)
\item If systems are very large, one combination of \(U_1\), \(U_2\) and \(\Omega\)
will be much more probably than all others
\item What value of \(U_1\) and \(U_2=U-U_1\) maximizes \(\Omega\)?
\end{enumerate}
\end{enumerate}
\begin{displaymath}
 \left ( \frac{\partial \ln \Omega_1}{\partial U_1} \right )_N = \left ( \frac{\partial \ln \Omega_2}{\partial U_2} \right )_N
\end{displaymath}
\begin{displaymath}
 \left ( \frac{\partial S_1}{\partial U_1} \right )_N = \left ( \frac{\partial S_2}{\partial U_2} \right )_N
\end{displaymath}
\begin{enumerate}
\item Thermal equilibrium is determined by equal \textbf{temperature!}
\begin{displaymath}
    \frac{1}{T}=\left ( \frac{\partial S}{\partial U} \right )_N
  \end{displaymath}
\begin{enumerate}
\item When the temperatures of the two subsystems are equal, the
entropy of the combined system is maximized!
\item (Same arguments lead to requirement that equal pressures (\(P_i\)) and
equal chemical potentials (\(\mu_i\)) maximize entropy when volumes or
particles are exchanged)
\end{enumerate}
\end{enumerate}

\subsubsection{Two-state model in limit of large \(N\)}
\label{sec:orga9966c3}
\begin{enumerate}
\item Large \(N\) and Stirling's approximation
\item Fundamental thermodynamic equation of two-state system:
\begin{displaymath}
  S(U)=-k_B \left ( x \ln x + (1-x) \ln (1-x) \right ), \mathrm{where}\
  x = q/N = U/N\epsilon
\end{displaymath}
\item Temperature is derivative of entropy wrt energy yields
\begin{displaymath}
  U(T) = \frac{N\epsilon}{1+e^{\epsilon/k_BT}}
\end{displaymath}
\begin{enumerate}
\item \(T \rightarrow 0, U \rightarrow 0, S \rightarrow 0\), minimum disorder
\item \(T \rightarrow \infty, U \rightarrow N\epsilon/2, S \rightarrow
              k_B \ln 2\), maximum disorder
\end{enumerate}
\item Differentiate again to get heat capacity
\end{enumerate}
