Outline/CBE60553-outline.org
*** Partition function
      1. Where do fundamental equations come from?
      2. Direct construction of $S(U)$ is generally intractable, so seek simpler approach
      3. Imagine a system brought into thermal equilibrium with a much
         larger ``reservoir'' of constant $T$, such that the aggregate has a
         total energy $U$
      4. Degeneracy of a given system microstate $j$ with energy $U_j$
         is $\Omega_{res}(U-U_j)$
         \begin{eqnarray*}
           T = \frac{dU_{res}}{k_Bd\ln\Omega_{res}} \\
           \Omega_{res}(U-U_j) \propto e^{-U_j/k_B T}
         \end{eqnarray*}
      5. Probability for system to be in a microstate with energy $U_j$ given by Boltzmann
         distribution!
         \begin{displaymath}
           P(U_j) \propto e^{-U_j/k_B T} = e^{-U_j \beta}
         \end{displaymath}
      6. Partition function ``normalizes'' distribution, $Q(T) = \sum_j
         e^{-U_j \beta}$
      7. For system of identical (distinguishable) elements with energy states $\epsilon_i$,
         can factor probability to show
         \begin{eqnarray*}
           P(\epsilon_i) \propto e^{-\epsilon_i/k_B T} = e^{-\epsilon_i \beta},\
           \ \ \ \ \beta=1/k_BT
         \end{eqnarray*}

*** Energy factoring
   1. If system is large, how to determine it's energy states $U_j$?  There
	would be many, many of them!
   2. One simplification is if we can write energy as sum of energies of
	individual elements (atoms, molecules) of system:
      \begin{align}
	U_j&=\epsilon_j(1)+\epsilon_j(2) + ... + \epsilon_j(N) \\
	Q(N,V,T) &= \sum_j e^{-U_j\beta} \\
	&=\sum_je^{-(\epsilon_j(1)+\epsilon_j(2) + ... + \epsilon_j(N))\beta}
      \end{align}
   3. /If/ molecules/elements of system can be distinguished from each
          other (like atoms in a fixed lattice), expression can be factored:
	\begin{align}
          Q(N,V,T)&=\left ( \sum_j e^{-\epsilon_j(1)\beta}\right )\cdots \left ( \sum_j
            e^{-\epsilon_j(N)\beta}\right ) \\
	&= q(1)\cdots q(N) \\
	\text{Assuming all the elements are the same:}\\
	&= q^N \\
       q&=\sum_j e^{-\epsilon_j \beta}: \mathrm{molecular\ partition\ function}
     \end{align}
   4. /If not/ distinguishable (like molecules in a liquid or gas, or
	electrons in a solid), problem is difficult, because identical
	arrangements of energy amongst elements should only be counted once.
	Approximate solution, good almost all the time:}
      \begin{equation}
	Q(N,V,T)=q^N/N!
      \end{equation}
   5. Sidebar: "Correct" factoring depends on whether individual elements are fermions or bosons, leads to funny things like superconductivity and superfluidity.

*** Two-state system again
1. Partition function, $q(T)=1+e^{-\epsilon\beta}$
2. State probabilities
3. Internal energy $U(T)$
   \begin{equation}
     U(T)=-N \left ( \frac{\partial \ln(1+e^{-\epsilon\beta})}{\partial\beta}
     \right)=\frac{N\epsilon e^{-\epsilon\beta}}{1+e^{-\epsilon\beta}}
   \end{equation}
4. Heat capacity $C_v$
 1. Minimum when change in states with $T$ is small
 2. Maximize when chagne in states with $T$ is large
5. Helmholtz energy, $A= -\ln q/\beta$, decreasing function of $T$
6. Entropy
7. Distinguishable vs.\ indistinguishable particles
 1. Distinguishable (e.g., in a lattice): $Q(N,V,T) = q(V,T)^N$
 2. Indistinguishable (e.g., a gas): $Q(N,V,T)\approx q(V,T)^N/N!$
8. Thermodynamic functions in canonical ensemble

#+BEGIN_EXPORT LaTeX
\begin{table}\small
  \begin{center}
    \caption{Equations of the Canoncial ($NVT$) Ensemble}
    \label{Canonical}
    \begin{tabular}[h]{lccc}
      \hline
$\beta=1/k_BT$ & {\bf Full Ensemble} & {\bf Distinguishable particles} & {\bf Indistinguishable
particles} \\
               &               & (e.g. atoms in a lattice) & (e.g. molecules in
               a fluid) \\
\hline
Single particle & & & \\partition function& & $\displaystyle q(V,T) = \sum_i
e^{-\epsilon_i\beta} $& $\displaystyle q(V,T) = \sum_i e^{-\epsilon_i\beta} $ \\
Full partition & & & \\function & $\displaystyle Q(N,V,T) = \sum_j e^{-U_j\beta} $ &
$\displaystyle Q = q(V,T)^N $ & $\displaystyle Q = q(V,T)^N/N! $ \\
Log partition &  $\ln Q$ & $N\log q$ & $ N\ln q - \ln N! $\\
function & & & $\approx N(\ln Q - \ln N +1)$ \\ & & & \\
Helmholtz energy & $\displaystyle -\frac{\ln Q}{\beta}$ & $\displaystyle
-\frac{N\ln q}{\beta}$ & $\displaystyle -\frac{N}{\beta}\left (\ln\frac{q}{N} +
  1 \right ) $ \\
($A=U-TS$) & & & \\ & & &  \\
Internal energy ($U$)& $\displaystyle -\left (\frac{\partial\ln
    Q}{\partial\beta}\right )_{NV}$ & $\displaystyle -N\left (\frac{\partial\ln
    q}{\partial\beta}\right )_{V}$ &  $\displaystyle -N\left (\frac{\partial\ln
    q}{\partial\beta}\right )_{V}$ \\ & & & \\
Pressure ($P$) & $\displaystyle \frac{1}{\beta}\left (\frac{\partial\ln
    Q}{\partial V}\right )_{N\beta}$ & $\displaystyle \frac{N}{\beta}\left (\frac{\partial\ln
    q}{\partial V}\right )_{\beta}$ &  $\displaystyle \frac{N}{\beta}\left (\frac{\partial\ln
    q}{\partial V}\right )_{\beta}$ \\ & & & \\

Entropy ($S/k_B$) & $ \beta U + \ln Q$ & $\beta U + N \ln q$ & $\beta U +
N\left ( \ln(q/N) + 1\right )$ \\ & & & \\
Chemical potential ($\mu$) & $\displaystyle -\frac{1}{\beta}\left ( \frac{\partial \ln
    Q}{\partial N}\right )_{VT} $& $\displaystyle -\frac{\ln q}{\beta}$ & $\displaystyle
-\frac{\ln (q/N)}{\beta}$ \\ & & & \\
\hline
    \end{tabular}
{\bf NOTE!} All energies are referenced to their values at 0~K.  Enthalpy $H=U+PV$, Gibb's
Energy $G=A+PV$.
  \end{center}
\end{table}
#+END_EXPORT

** Ideal gases redux
*** Separability
      \begin{displaymath}
        Q_{ig}(N,V,T) = \frac{(q_\mathrm{trans}q_\mathrm{rot}q_\mathrm{vib})^N}{N!}
  \end{displaymath}

*** Particle-in-a-box (translational states of a gas)
1. Energy states $\epsilon_n=n^2\epsilon_0, n=1,2, \ldots$,
   $\epsilon_0$ tiny for macroscopic $V$
2. $\Theta_\mathrm{trans} = \epsilon_0/k_B$ translational temperature
3. $\Theta_\mathrm{trans} << T \rightarrow$ /many/ states contribute
   to $q_\mathrm{trans}\rightarrow$ integral approximation
   \begin{eqnarray*}
     q_\mathrm{trans,1D} = \int_0^\infty e^{-x^2\beta\epsilon_0}dx =
     L/\Lambda \\
     \Lambda = \left ( \frac{h^2\beta}{2\pi m} \right )^{1/2}\
     \mathrm{thermal\ wavelength} \\
     q_\mathrm{trans,3D} = V/\Lambda^3
   \end{eqnarray*}
4. Internal energy
5. Heat capacity
6. Equation of state (!)
7. Entropy: Sackur-Tetrode equation
*** Rigid rotor (rotational states of a gas)
1. energy states and degeneracies
2. $\Theta_\mathrm{rot} = \hbar^2/2 I k_B$
3. ``High'' T $q_\mathrm{rot}(T) \approx \sigma \Theta_\mathrm{rot}/T$
*** Harmonic oscillator (vibrational states of a gas)
1. $\Theta_\mathrm{vib}=h\nu/k_B$
*** Electronic partition functions $\rightarrow$ spin multiplicity
