Outline/CBE60553-outline.org
*** Solids
1. Equipartition
2. Law of Dulong and Petitt
3. Einstein crystal and heat capacity
4. Debye crysal

#+BEGIN_EXPORT LaTeX
\begin{table}
\begin{center}
    \caption{\large{Statistical Thermodynamics of an Ideal Gas}}
   \begin{description}
    \item[\underline{Translational DOFs}] {3-D particle in a box model}

$\displaystyle \theta_\mathrm{trans}= \frac{\pi^2\hbar^2}{2 m
  L^2 k_B}$,
$\displaystyle \Lambda=h\left( \frac{\beta}{2\pi m}\right )^{1/2}$

For $ T >> \Theta_\mathrm{trans}$, $\Lambda << L$, $\displaystyle
q_\mathrm{trans}=V/\Lambda^3$ (essentially always true)

\begin{tabular}{ccc}
$\displaystyle U_\mathrm{trans}=\frac{3}{2}RT$ & $\displaystyle C_\mathrm{v,trans} =
\frac{3}{2}R $ & $\displaystyle S^\circ_\mathrm{trans}=R \ln \left (
  \frac{e^{5/2}V^\circ}{N^\circ \Lambda^3}\right ) = R \ln \left (
  \frac{e^{5/2}k_BT}{P^\circ \Lambda^3}\right ) $ \\
\end{tabular}

  \item[\underline{Rotational DOFs}] {Rigid rotor model}
\begin{description}
\item[Linear molecule]{}
$\theta_\mathrm{rot} =hcB/k_B$

\begin{equation*}
q_\mathrm{rot}=\frac{1}{\sigma}\sum_{l=0}^\infty (2l+1)e^{-l(l+1)\theta_\mathrm{rot}/T},
\approx \frac{1}{\sigma}\frac{T}{\theta_\mathrm{rot}},\ \ T>>\theta_\mathrm{rot}\ \ \ \sigma = \left \{
        \begin{array}{rl}
          1, & \text{unsymmetric} \\
          2, & \text{symmetric}
        \end{array} \right .
\end{equation*}
\begin{tabular}{ccc}
$\displaystyle U_\mathrm{rot}=RT$ & $\displaystyle C_\mathrm{v,rot} =
R $ & $\displaystyle S^\circ_\mathrm{rot}=R (1-\ln(\sigma\theta_\mathrm{rot}/T)) $ \\
\end{tabular}

\item[Non-linear molecule]{} $\theta_{\mathrm{rot},\alpha}=hcB_\alpha/k_B$
\begin{equation*}
q_\mathrm{rot}
\approx \frac{1}{\sigma}\left ( \frac{\pi
    T^3}{\theta_{\mathrm{rot},\alpha}\theta_{\mathrm{rot},\beta}\theta_{\mathrm{rot},\gamma}}
  \right )^{1/2},\ \ T>>\theta_{\mathrm{rot},\alpha,\beta,\gamma}\ \ \ \sigma =
  \text{rotational symmetry number}
\end{equation*}
\begin{tabular}{ccc}
$\displaystyle U_\mathrm{rot}=\frac{3}{2}RT$ & $\displaystyle C_\mathrm{v,rot} = \frac{3}{2}
R $ & $\displaystyle S^\circ_\mathrm{rot}=\frac{R}{2}
\left ( 3-\ln\frac{\sigma\theta_{\mathrm{rot},\alpha}\theta_{\mathrm{rot},\beta}\theta_{\mathrm{rot},\gamma}}{\pi
  T^3} \right ) $ \\
\end{tabular}

\end{description}

\item[\underline{Vibrational DOFs}] {Harmonic oscillator model}
\begin{description}
\item[Single harmonic mode] {$\theta_\mathrm{vib}=h\nu/k_B $}
  \begin{equation*}
    q_\mathrm{vib}=\frac{1}{1-e^{-\theta_\mathrm{vib}/T}} \approx
      \frac{T}{\theta_\mathrm{vib}}, \ \ \ T>>\theta_\mathrm{vib}
  \end{equation*}

\begin{tabular}{ccc}
$ U_\mathrm{vib}= $ & $  C_\mathrm{v,vib} = $ & $S^\circ_{\mathrm{vib},i}=$ \\
$\displaystyle
R\frac{\theta_\mathrm{vib}}{e^{\theta_\mathrm{vib}/T}-1}$ &
$\displaystyle R\left (
  \frac{\theta_\mathrm{vib}}{T}\frac{e^{\theta_\mathrm{vib}/2T}}{e^{\theta_\mathrm{vib}/T}-1}
\right )^2 $ & $\displaystyle R \left ( \frac{\theta_\mathrm{vib}/T}{e^{\theta_\mathrm{vib}/T}-1}
-\ln(1-e^{-\theta_\mathrm{vib}/T})\right ) $ \\
\end{tabular}

\item[Multiple harmonic modes] {$\theta_{\mathrm{vib},i}=h\nu_i/k_B $}

  \begin{equation*}
    q_\mathrm{vib}=\prod_i\frac{1}{1-e^{-\theta_{\mathrm{vib},i}/T}}
  \end{equation*}

\begin{tabular}{ccc}
$ U_\mathrm{vib}= $ & $  C_\mathrm{v,vib} = $ & $S^\circ_{\mathrm{vib},i}=$ \\
$\displaystyle
R\sum_i\frac{\theta_{\mathrm{vib},i}}{e^{\theta_{\mathrm{vib},i}/T}-1}$ &
$\displaystyle R \sum_i \left (
  \frac{\theta_{\mathrm{vib},i}}{T}\frac{e^{\theta_{\mathrm{vib},i}/2T}}{e^{\theta_{\mathrm{vib},i}/T}-1}
\right )^2 $ & $\displaystyle R \left ( \frac{\theta_{\mathrm{vib},i}/T}{e^{\theta_{\mathrm{vib},i}/T}-1}
-\ln(1-e^{-\theta_{\mathrm{vib},i}/T})\right ) $ \\
\end{tabular}

\end{description}
\item[\underline{Electronic DOFs}] {}
$q_\mathrm{elec} = \text{spin multiplicity}$

\end{description}
\end{center}
\end{table}
#+END_EXPORT

#+BEGIN_EXPORT LaTeX
\begin{table}
  \begin{center}
    \caption{\large{Contributions of Molecular Degrees of Freedom to Gas Thermodynamics}}
    \begin{tabular}{lcccc}
\hline \\
{\bf DOF}  & {\bf Characteristic} & {\bf Characteristic} & {\bf \#states at} & {\bf Internal }\\
        & {\bf energy}  & {\bf temperature} & {\bf $\approx 300$~K} & {\bf energy }\\
\hline \\
Translational & $\epsilon_\mathrm{trans} = \frac{\hbar^2}{2mL^2} \approx 10^{-21} \mathrm{cm}^{-1} $ &
$\theta_\mathrm{trans} \approx 10^{-21}$~K & $\approx 10^{30}$ & $U= \frac{3}{2}RT $  \\ \\
Rotational & $\epsilon_\mathrm{rot} \approx 1~\mathrm{cm}^{-1}$ & $\theta_\mathrm{rot} \approx 1$~K &
$\approx 100s$ & $\approx \mathrm{\#DOF}\cdot RT $\\ \\
Vibrational & $\epsilon_\mathrm{vib} \approx 1000~\mathrm{cm}^{-1} $ & $\theta_\mathrm{vib} \approx
1000$~K & $\approx 1$ & non-classical, $0\rightarrow RT$ \\ \\
Electronic & $\epsilon_\mathrm{elec} \approx 10000~\mathrm{cm}^{-1} $ & $\theta_\mathrm{elec} \approx
10000$~K & $\approx 1$ & 0\\
\hline
    \end{tabular}
\begin{eqnarray*}
Q = \left ( q_\mathrm{trans} q_\mathrm{rot} q_\mathrm{vib} q_\mathrm{elec} \right )^N/N! \\
 \\
U = U_\mathrm{trans} + U_\mathrm{rot} + U_\mathrm{vib} + U_\mathrm{elec}, \ldots
\end{eqnarray*}
  \end{center}

\end{table}
#+END_EXPORT

*** Other ensembles
1. Isothermal/isobaric
   1. $\Delta(T,P,N) = \sum_j e^{-U_j\beta} e^{-PV_j\beta}$
   2. $G(T,P,N) = -k_B T \ln \Delta(T,P,N)$
2. Grand canonical
   1. $\Xi(T,V,\mu) = \sum_j e^{-U_j\beta} e^{-PV_j\beta}e^{\mu N_j \beta}$
   2. $\Psi(T,V,\mu) = - k_B T \ln \Xi(T,V,\mu)$
   3. Langmuir isotherm example
* Thermodynamics of Stuff
** Common idea :noexport:
Order parameters
| \rho         | vapor-liquid equilibrium |
| \xi          | chemical equilibrium     |
| $x_i$, $y_i$ | phase equilibrium        |

** Theory of non-ideal fluids
*** Non-ideality
  1. Real molecules interact through vdW interactions
     1. dipole-dipole, dipole-induced dipole, induced dipole-induced dipole
	(London dispersion)
     2. scale with dipole moments($\vec{\mu}$ and polarizability volumes
	($\alpha$) of molecules
     3. $U(r) \approx - c/r^6$
  2. Particle-in-a-box model breaks down, have to work harder but
     can still get at same ideas
  3. Configurational integral $Q_\mathrm{config}=\int \ldots \int e^{-U(r)\beta} dr_1\ldots dr_n$
*** van der Waals gas
  1. Hard sphere + $1/r^6$ potential + mean-field approximation ($g(r)=1$)
  2. $Q_\mathrm{config} = ((V-Nb) \exp (-(\phi/2)\beta))^N \rightarrow$ vdW EOS
  3. See Hill, /J. Chem. Ed./ *1948*, /25/, 347, [[http://dx.doi.org/10.1021/ed025p347]]
  4. Free energy has two competing contributions
  5. $f_\text{vdW} = - k_BT \ln \{ (v-b)(k_BT)^{3/2}\} -a/v -k_BT$
  6. $P_\text{vdW}=RT/(v-b) - a/v^2$

*** Radial distribution functions, $g(r)$, for gases, liquids, solids
*** Virial expansion
  1. Configurational integral can be expanded in powers of $1/v$ times "virial"
     coefficients $B_j(T)$
  2. $f(T,P) = f_\text{ig}(T,P) - RT \{ B_2(T)/v + B_3(T)/v^2 + \ldots \}$
  3. $Z = 1 + B_2(T)/v + B_3(T)/v^2 + \dots$
  4. "Second" virial coefficient $B_2(T)$ limiting low density "departure" of
     volume from that of an ideal gas, $v_\text{res}(T,v) = v -
     v_\text{ig}=(RT/P)(Z-1)$
             \[B_2(T) = \lim_{v \rightarrow \infty} v_\text{res}, \]
     - Virial coefficients integrate ``clusters'' of intermolecular interactions, 2-body, 3-body, $\ldots$
  5. $B_2(T) = -2\pi N_A \int_0^\infty \{e^{-u(r)/k_BT}-1\}r^2dr$
  6. $B_2^\text{vdW} (T) = b -a/RT$
  7. Lennard-Jones potential

*** Modern approach is to use numerical methods
  1. "forcefield" to represent intra- and intermolecular properties
  2. molecular dynamics or Monte Carlo to sample interactions
  3. Fluid property challenge at AIChE

** Engineering representations of fluids
