Outline/CBE60553-outline.tex
\subsubsection{Solids}
\label{sec:org7918afc}
\begin{enumerate}
\item Equipartition
\item Law of Dulong and Petitt
\item Einstein crystal and heat capacity
\item Debye crysal
\end{enumerate}

\begin{table}
\begin{center}
    \caption{\large{Statistical Thermodynamics of an Ideal Gas}}
   \begin{description}
    \item[\underline{Translational DOFs}] {3-D particle in a box model}

$\displaystyle \theta_\mathrm{trans}= \frac{\pi^2\hbar^2}{2 m
  L^2 k_B}$,
$\displaystyle \Lambda=h\left( \frac{\beta}{2\pi m}\right )^{1/2}$

For $ T >> \Theta_\mathrm{trans}$, $\Lambda << L$, $\displaystyle
q_\mathrm{trans}=V/\Lambda^3$ (essentially always true)

\begin{tabular}{ccc}
$\displaystyle U_\mathrm{trans}=\frac{3}{2}RT$ & $\displaystyle C_\mathrm{v,trans} =
\frac{3}{2}R $ & $\displaystyle S^\circ_\mathrm{trans}=R \ln \left (
  \frac{e^{5/2}V^\circ}{N^\circ \Lambda^3}\right ) = R \ln \left (
  \frac{e^{5/2}k_BT}{P^\circ \Lambda^3}\right ) $ \\
\end{tabular}

  \item[\underline{Rotational DOFs}] {Rigid rotor model}
\begin{description}
\item[Linear molecule]{}
$\theta_\mathrm{rot} =hcB/k_B$

\begin{equation*}
q_\mathrm{rot}=\frac{1}{\sigma}\sum_{l=0}^\infty (2l+1)e^{-l(l+1)\theta_\mathrm{rot}/T},
\approx \frac{1}{\sigma}\frac{T}{\theta_\mathrm{rot}},\ \ T>>\theta_\mathrm{rot}\ \ \ \sigma = \left \{
        \begin{array}{rl}
          1, & \text{unsymmetric} \\
          2, & \text{symmetric}
        \end{array} \right .
\end{equation*}
\begin{tabular}{ccc}
$\displaystyle U_\mathrm{rot}=RT$ & $\displaystyle C_\mathrm{v,rot} =
R $ & $\displaystyle S^\circ_\mathrm{rot}=R (1-\ln(\sigma\theta_\mathrm{rot}/T)) $ \\
\end{tabular}

\item[Non-linear molecule]{} $\theta_{\mathrm{rot},\alpha}=hcB_\alpha/k_B$
\begin{equation*}
q_\mathrm{rot}
\approx \frac{1}{\sigma}\left ( \frac{\pi
    T^3}{\theta_{\mathrm{rot},\alpha}\theta_{\mathrm{rot},\beta}\theta_{\mathrm{rot},\gamma}}
  \right )^{1/2},\ \ T>>\theta_{\mathrm{rot},\alpha,\beta,\gamma}\ \ \ \sigma =
  \text{rotational symmetry number}
\end{equation*}
\begin{tabular}{ccc}
$\displaystyle U_\mathrm{rot}=\frac{3}{2}RT$ & $\displaystyle C_\mathrm{v,rot} = \frac{3}{2}
R $ & $\displaystyle S^\circ_\mathrm{rot}=\frac{R}{2}
\left ( 3-\ln\frac{\sigma\theta_{\mathrm{rot},\alpha}\theta_{\mathrm{rot},\beta}\theta_{\mathrm{rot},\gamma}}{\pi
  T^3} \right ) $ \\
\end{tabular}

\end{description}

\item[\underline{Vibrational DOFs}] {Harmonic oscillator model}
\begin{description}
\item[Single harmonic mode] {$\theta_\mathrm{vib}=h\nu/k_B $}
  \begin{equation*}
    q_\mathrm{vib}=\frac{1}{1-e^{-\theta_\mathrm{vib}/T}} \approx
      \frac{T}{\theta_\mathrm{vib}}, \ \ \ T>>\theta_\mathrm{vib}
  \end{equation*}

\begin{tabular}{ccc}
$ U_\mathrm{vib}= $ & $  C_\mathrm{v,vib} = $ & $S^\circ_{\mathrm{vib},i}=$ \\
$\displaystyle
R\frac{\theta_\mathrm{vib}}{e^{\theta_\mathrm{vib}/T}-1}$ &
$\displaystyle R\left (
  \frac{\theta_\mathrm{vib}}{T}\frac{e^{\theta_\mathrm{vib}/2T}}{e^{\theta_\mathrm{vib}/T}-1}
\right )^2 $ & $\displaystyle R \left ( \frac{\theta_\mathrm{vib}/T}{e^{\theta_\mathrm{vib}/T}-1}
-\ln(1-e^{-\theta_\mathrm{vib}/T})\right ) $ \\
\end{tabular}

\item[Multiple harmonic modes] {$\theta_{\mathrm{vib},i}=h\nu_i/k_B $}

  \begin{equation*}
    q_\mathrm{vib}=\prod_i\frac{1}{1-e^{-\theta_{\mathrm{vib},i}/T}}
  \end{equation*}

\begin{tabular}{ccc}
$ U_\mathrm{vib}= $ & $  C_\mathrm{v,vib} = $ & $S^\circ_{\mathrm{vib},i}=$ \\
$\displaystyle
R\sum_i\frac{\theta_{\mathrm{vib},i}}{e^{\theta_{\mathrm{vib},i}/T}-1}$ &
$\displaystyle R \sum_i \left (
  \frac{\theta_{\mathrm{vib},i}}{T}\frac{e^{\theta_{\mathrm{vib},i}/2T}}{e^{\theta_{\mathrm{vib},i}/T}-1}
\right )^2 $ & $\displaystyle R \left ( \frac{\theta_{\mathrm{vib},i}/T}{e^{\theta_{\mathrm{vib},i}/T}-1}
-\ln(1-e^{-\theta_{\mathrm{vib},i}/T})\right ) $ \\
\end{tabular}

\end{description}
\item[\underline{Electronic DOFs}] {}
$q_\mathrm{elec} = \text{spin multiplicity}$

\end{description}
\end{center}
\end{table}

\begin{table}
  \begin{center}
    \caption{\large{Contributions of Molecular Degrees of Freedom to Gas Thermodynamics}}
    \begin{tabular}{lcccc}
\hline \\
{\bf DOF}  & {\bf Characteristic} & {\bf Characteristic} & {\bf \#states at} & {\bf Internal }\\
        & {\bf energy}  & {\bf temperature} & {\bf $\approx 300$~K} & {\bf energy }\\
\hline \\
Translational & $\epsilon_\mathrm{trans} = \frac{\hbar^2}{2mL^2} \approx 10^{-21} \mathrm{cm}^{-1} $ &
$\theta_\mathrm{trans} \approx 10^{-21}$~K & $\approx 10^{30}$ & $U= \frac{3}{2}RT $  \\ \\
Rotational & $\epsilon_\mathrm{rot} \approx 1~\mathrm{cm}^{-1}$ & $\theta_\mathrm{rot} \approx 1$~K &
$\approx 100s$ & $\approx \mathrm{\#DOF}\cdot RT $\\ \\
Vibrational & $\epsilon_\mathrm{vib} \approx 1000~\mathrm{cm}^{-1} $ & $\theta_\mathrm{vib} \approx
1000$~K & $\approx 1$ & non-classical, $0\rightarrow RT$ \\ \\
Electronic & $\epsilon_\mathrm{elec} \approx 10000~\mathrm{cm}^{-1} $ & $\theta_\mathrm{elec} \approx
10000$~K & $\approx 1$ & 0\\
\hline
    \end{tabular}
\begin{eqnarray*}
Q = \left ( q_\mathrm{trans} q_\mathrm{rot} q_\mathrm{vib} q_\mathrm{elec} \right )^N/N! \\
 \\
U = U_\mathrm{trans} + U_\mathrm{rot} + U_\mathrm{vib} + U_\mathrm{elec}, \ldots
\end{eqnarray*}
  \end{center}

\end{table}

\subsubsection{Other ensembles}
\label{sec:org347d6d5}
\begin{enumerate}
\item Isothermal/isobaric
\begin{enumerate}
\item \(\Delta(T,P,N) = \sum_j e^{-U_j\beta} e^{-PV_j\beta}\)
\item \(G(T,P,N) = -k_B T \ln \Delta(T,P,N)\)
\end{enumerate}
\item Grand canonical
\begin{enumerate}
\item \(\Xi(T,V,\mu) = \sum_j e^{-U_j\beta} e^{-PV_j\beta}e^{\mu N_j \beta}\)
\item \(\Psi(T,V,\mu) = - k_B T \ln \Xi(T,V,\mu)\)
\item Langmuir isotherm example
\end{enumerate}
\end{enumerate}
\section{Thermodynamics of Stuff}
\label{sec:org9b5d898}
\subsection{Theory of non-ideal fluids}
\label{sec:org72d0b6d}
\subsubsection{Non-ideality}
\label{sec:orgfe4ce12}
\begin{enumerate}
\item Real molecules interact through vdW interactions
\begin{enumerate}
\item dipole-dipole, dipole-induced dipole, induced dipole-induced dipole
(London dispersion)
\item scale with dipole moments(\(\vec{\mu}\) and polarizability volumes
(\(\alpha\)) of molecules
\item \(U(r) \approx - c/r^6\)
\end{enumerate}
\item Particle-in-a-box model breaks down, have to work harder but
can still get at same ideas
\item Configurational integral \(Q_\mathrm{config}=\int \ldots \int e^{-U(r)\beta} dr_1\ldots dr_n\)
\end{enumerate}
\subsubsection{van der Waals gas}
\label{sec:org73b8969}
\begin{enumerate}
\item Hard sphere + \(1/r^6\) potential + mean-field approximation (\(g(r)=1\))
\item \(Q_\mathrm{config} = ((V-Nb) \exp (-(\phi/2)\beta))^N \rightarrow\) vdW EOS
\item See Hill, \emph{J. Chem. Ed.} \textbf{1948}, \emph{25}, 347, \url{http://dx.doi.org/10.1021/ed025p347}
\item Free energy has two competing contributions
\item \(f_\text{vdW} = - k_BT \ln \{ (v-b)(k_BT)^{3/2}\} -a/v -k_BT\)
\item \(P_\text{vdW}=RT/(v-b) - a/v^2\)
\end{enumerate}

\subsubsection{Radial distribution functions, \(g(r)\), for gases, liquids, solids}
\label{sec:org2f5400b}
\subsubsection{Virial expansion}
\label{sec:orgaebe384}
\begin{enumerate}
\item Configurational integral can be expanded in powers of \(1/v\) times ``virial''
coefficients \(B_j(T)\)
\item \(f(T,P) = f_\text{ig}(T,P) - RT \{ B_2(T)/v + B_3(T)/v^2 + \ldots \}\)
\item \(Z = 1 + B_2(T)/v + B_3(T)/v^2 + \dots\)
\item ``Second'' virial coefficient \(B_2(T)\) limiting low density ``departure'' of
volume from that of an ideal gas, \(v_\text{res}(T,v) = v -
     v_\text{ig}=(RT/P)(Z-1)\)
	\[B_2(T) = \lim_{v \rightarrow \infty} v_\text{res}, \]
\begin{itemize}
\item Virial coefficients integrate ``clusters'' of intermolecular interactions, 2-body, 3-body, \(\ldots\)
\end{itemize}
\item \(B_2(T) = -2\pi N_A \int_0^\infty \{e^{-u(r)/k_BT}-1\}r^2dr\)
\item \(B_2^\text{vdW} (T) = b -a/RT\)
\item Lennard-Jones potential
\end{enumerate}

\subsubsection{Modern approach is to use numerical methods}
\label{sec:orga32a4da}
\begin{enumerate}
\item ``forcefield'' to represent intra- and intermolecular properties
\item molecular dynamics or Monte Carlo to sample interactions
\item Fluid property challenge at AIChE
\end{enumerate}

\subsection{Engineering representations of fluids}
\label{sec:org5e0ac7c}
