Outline/CBE60553-outline.org
*** How to represent properties of real fluids?
  1. Mechanical equations of state (empirical)
  2. Thermodynamic tabulations (JANAF, steam tables)
  3. Theoretical models (virial expansion)
  4. Computer simulations (molecular interactions)

*** Thermodynamic integrations
  1. Integrate susceptibilities
  2. Integrate $PvT$ relationship plus $C_p^{ig}(T)$

*** Compressibility
     1. Fluids deviate from ideality because they have finite size and interact over distances, origin of two-parameter EOS
     2. Compressibility $Z(T,P)=P/P^{ig}=Pv/RT$ measures deviation from ideality
     3. Critical compressibility $Z_c \approx 0.27$ for all "normal" fluids
     4. Reduced variable $T_R=T/T_c$, $P_R = P/P_c$, $v_R = v/v_c$
     5. "Law" of corresponding states---all "normal" fluids have the same $PvT$ behavior in reduced variables
     6. Allows fluids to be described on generalized compressibility chart

*** Cubic mechanical equations of state
  1. van der Waals, $Z_c = 0.375$
  2. Redlich-Kwong,  $Z_c = 0.333$
  3. Peng-Robinson, $Z_c = 0.307$
  4. Empirically parameterized, all obey law of corresponding states, none perfect
*** Departure functions measure thermodynamic potential difference between real
            state and hypothetical "ideal gas" state
     1. \Delta{}whatever = \Delta ideal + \Delta departure
     2. From generalized compressibility or accurate EOS integration
     3. Entropy departure \(s(T,P) - s^{ig}(T,P) = R \ln Z(T,P) + \int_\infty^{v(T,P)} \left [ \left ( \frac{\partial P}{\partial T}\right )_v - \frac{R}{v} \right ] dv\)
     4. Enthalpy departure \(h(T,P) - h^{ig}(T,P) = RT \left ( Z-1 \right )  + \int_\infty^{v(T,P)} \left [ T \left  ( \frac{\partial P}{\partial T}\right )_v - P \right ] dv\)
*** Fugacity measures departure of free energy ideality
1. Define $\mu(T,P) = \mu^\circ(T) + RT \ln f(T,P)/f^\circ(T)$
 \begin{equation*}
   \lim_{P\rightarrow 0} \mu = -\infty\quad \lim_{P\rightarrow 0} f =P^\text{ig} =0
 \end{equation*}
 \begin{equation*}
   \ln f/P = \dfrac{RT}{P}\int_0^P(Z-1)dP
 \end{equation*}
2. $\mu^\alpha = \mu^\beta$ implies $f^\alpha = f^\beta$.
3. Fugacity coefficient $\gamma(T,P) = f(T,P)/P$
 \begin{equation*}
   \ln\gamma=\int_o^P\dfrac{Z-1}{P}dP
 \end{equation*}
** Single-phase mixtures
*** Ideal gas mixtures
   1. Statistical mechanical approach
   2. Properties of ideal mixture
             \begin{equation*}
               \Delta u_\text{mix} = \Delta v_\text{mix} = 0 \qquad \Delta s_\text{mix} = - k_B \sum_i y_i \ln y_i
             \end{equation*}
   3. Partial pressure $P_i = y_i P$
   4. Chemical potential \(\mu_i(y_i,T) = \mu_i^\circ(T) + k_B T \ln \left ( y_i
              P/P^\circ \right)\)
   5. Work of separation and Gibbs paradox

*** Non-ideal gas mixtures
1. Inconvenient that \(\lim_{y_{i}\to 0}\mu_i(y_i,T,P) = -\infty \)
2. Construct /fugacity/ to obey same equilibrium conditions as chemical potential but to tend to \(y_{i}P\) in infinite dilution
    \begin{equation*}
      \bar{f}_i(y_{i},T,P) = P^{\circ} \exp \left [ (\mu_i(y_i,T,P) - \mu_i^\circ(T))/ k_B T \right ]
    \end{equation*}
3. Chemical potential \(\mu_i(y_i,T,P) = \mu_i^\circ(T) + k_B T \ln \left ( /P^\circ \right)\)
4. Fugacity coefficient \(\phi_{i}(y_{i,T,P})=\bar{f}_{i}(y_{i},T,P)/(y_{i}P)\)
5. Fugacity can be computed from a mixture-explicit EOS
    \begin{equation*}
		R T \ln \left ( \bar{f}_i/y_i P \right ) = \int_0^P \left (
          \bar{v}_i - \frac{RT}{P} \right ) dP  =  \frac{1}{RT} \left ( \frac{\partial (F - F^\text{ig})}{\partial N_i} \right )_{T,V,N_{j\neq i}} - \ln Z
     \end{equation*}
6. Virial mixture equation, vdW equation, \ldots
7. Lorentz-Berthelot mixing
      \begin{equation*}
	b = \sum_i b_i \qquad a = \sum_i\sum_j y_i y_j a_{ij} \qquad a_{ij} = \sqrt{a_ia_j}
      \end{equation*}
8. Lewis (ideal) fugacity rule $\bar{f}_i \approx y_i f_i$ generalization of ideal gas
*** Ideal liquid mixtures
1. Lattice model with random distribution of molecules

   \begin{equation*}
   \Delta u_\text{mix} = \Delta v_\text{mix} = 0 \qquad \Delta s_\text{mix} = - k_B \sum_i x_i \ln x_i
   \end{equation*}
   \begin{equation*}
   \mu_i(x_i,T) = \mu_i^\circ(T) + k_B T \ln \left ( x_i \right)
   \end{equation*}

2. True for liquids of comparable molecular dimensions and interactions
*** Partial molar quantities
1. For any extensive quantity or susceptibility, $J$:
          \begin{equation*}
     \bar{J}_i = \left ( \frac{\partial J}{\partial N_i} \right )_{N_{j\neq i}}
          \qquad J = \sum_i \bar{J}_i N_i \qquad j = \sum \bar{J}_i x_i
          \end{equation*}
    \begin{equation*}
    \Delta j_\text{mix} = \sum_i \bar{J}_ix_i - \sum_i j_i x_i
    \end{equation*}
2. Gibbs-Duhem says partial molar properties are not independent: $\sum_i N_i d\bar{J}_i = 0$

*** Non-ideal liquid mixtures
1. Bragg-Williams/mean field approximation
2. Differential exchange parameter \(\chi_{AB} \)

   \begin{equation*}
      \chi_{12} = \frac{z}{k_BT}\left ( u_{12} - \frac{u_\text{11} +
       u_\text{22}}{2} \right )
   \end{equation*}

3. Hildebrand regular solution and excess mixing quantities
    \begin{equation*}
       \Delta g_\text{xs}/k_BT = \chi_{12} x_1(1-x_2)
    \end{equation*}
    \begin{equation*}
	\mu_1(T,x_1) = \mu_1^\text{ideal}(T,x_1) + k_B T \chi_{12} (1-x_1)^2
    \end{equation*}
4. Activity and activity coefficient
   1. Solvent convention
   2. Solute convention
5. Liquid-liquid phase diagrams
   1. Phase separation, critical point
6. Freezing point depression/boiling point elevation
*** Ionic mixtures
1. Debye-Huckel

** Gas-liquid equilibria
*** Ideal-ideal liquid-vapor mixtures
1. Equal chemical potentials in each phase
2. Equilibrium cycle (relate to single component phase equilibrium): start from single component l-v equilibrium, compress each component to desired pressure, then mix.
3. Gas compression important, liquid compression (Poynting correction) less so.
4. Ideal vapor-liquid equilibrium $\rightarrow$ Raoult's Law:
    \begin{equation*}
      \mu_i^\text{gas} = \mu_i^\text{liq} \rightarrow y_i P = x_i P_i^*
    \end{equation*}
5. Pressure-composition diagram
6. Temperature-composition diagram

*** Non-ideal liquid/ideal vapor
1. Regular solution
     \begin{equation*}
    \chi_{12} \left \{
     \begin{array}{rl}
       > 0 & \text{positive deviation from Raoult's Law,}\\
       = 0 & \text{Raoult's Law,}\\
       <0 & \text{negative deviation from Raoult's Law}
      \end{array} \right .
  \end{equation*}
2. Temperature-composition diagrams
   1. Liquid-vapor
   2. Eutectics, ...
3. Henry's Law (dilute) limit
4. Gibbs-Duhem consequences


# \subsection{Surfaces}
# %\item{{\bf Lecture 12: Surfaces}}

* Thermodynamics of Change
