Outline/CBE60553-outline.tex
\subsubsection{How to represent properties of real fluids?}
\label{sec:orgf016d31}
\begin{enumerate}
\item Mechanical equations of state (empirical)
\item Thermodynamic tabulations (JANAF, steam tables)
\item Theoretical models (virial expansion)
\item Computer simulations (molecular interactions)
\end{enumerate}

\subsubsection{Thermodynamic integrations}
\label{sec:org12ceaf1}
\begin{enumerate}
\item Integrate susceptibilities
\item Integrate \(PvT\) relationship plus \(C_p^{ig}(T)\)
\end{enumerate}

\subsubsection{Compressibility}
\label{sec:orgc7d66b8}
\begin{enumerate}
\item Fluids deviate from ideality because they have finite size and interact over distances, origin of two-parameter EOS
\item Compressibility \(Z(T,P)=P/P^{ig}=Pv/RT\) measures deviation from ideality
\item Critical compressibility \(Z_c \approx 0.27\) for all ``normal'' fluids
\item Reduced variable \(T_R=T/T_c\), \(P_R = P/P_c\), \(v_R = v/v_c\)
\item ``Law'' of corresponding states---all ``normal'' fluids have the same \(PvT\) behavior in reduced variables
\item Allows fluids to be described on generalized compressibility chart
\end{enumerate}

\subsubsection{Cubic mechanical equations of state}
\label{sec:orgf4d5cb9}
\begin{enumerate}
\item van der Waals, \(Z_c = 0.375\)
\item Redlich-Kwong,  \(Z_c = 0.333\)
\item Peng-Robinson, \(Z_c = 0.307\)
\item Empirically parameterized, all obey law of corresponding states, none perfect
\end{enumerate}
\subsubsection{Departure functions measure thermodynamic potential difference between real}
\label{sec:org520d5b0}
state and hypothetical ``ideal gas'' state
\begin{enumerate}
\item \(\Delta\)whatever = \(\Delta\) ideal + \(\Delta\) departure
\item From generalized compressibility or accurate EOS integration
\item Entropy departure \(s(T,P) - s^{ig}(T,P) = R \ln Z(T,P) + \int_\infty^{v(T,P)} \left [ \left ( \frac{\partial P}{\partial T}\right )_v - \frac{R}{v} \right ] dv\)
\item Enthalpy departure \(h(T,P) - h^{ig}(T,P) = RT \left ( Z-1 \right )  + \int_\infty^{v(T,P)} \left [ T \left  ( \frac{\partial P}{\partial T}\right )_v - P \right ] dv\)
\end{enumerate}
\subsubsection{Fugacity measures departure of free energy ideality}
\label{sec:orgef56ace}
\begin{enumerate}
\item Define \(\mu(T,P) = \mu^\circ(T) + RT \ln f(T,P)/f^\circ(T)\)
\begin{equation*}
  \lim_{P\rightarrow 0} \mu = -\infty\quad \lim_{P\rightarrow 0} f =P^\text{ig} =0
\end{equation*}
\begin{equation*}
  \ln f/P = \dfrac{RT}{P}\int_0^P(Z-1)dP
\end{equation*}
\item \(\mu^\alpha = \mu^\beta\) implies \(f^\alpha = f^\beta\).
\item Fugacity coefficient \(\gamma(T,P) = f(T,P)/P\)
\begin{equation*}
  \ln\gamma=\int_o^P\dfrac{Z-1}{P}dP
\end{equation*}
\end{enumerate}
\subsection{Single-phase mixtures}
\label{sec:org4259c10}
\subsubsection{Ideal gas mixtures}
\label{sec:org8bf9d79}
\begin{enumerate}
\item Statistical mechanical approach
\item Properties of ideal mixture
\begin{equation*}
  \Delta u_\text{mix} = \Delta v_\text{mix} = 0 \qquad \Delta s_\text{mix} = - k_B \sum_i y_i \ln y_i
\end{equation*}
\item Partial pressure \(P_i = y_i P\)
\item Chemical potential \(\mu_i(y_i,T) = \mu_i^\circ(T) + k_B T \ln \left ( y_i
              P/P^\circ \right)\)
\item Work of separation and Gibbs paradox
\end{enumerate}

\subsubsection{Non-ideal gas mixtures}
\label{sec:orgd16239b}
\begin{enumerate}
\item Inconvenient that \(\lim_{y_{i}\to 0}\mu_i(y_i,T,P) = -\infty\)
\item Construct \emph{fugacity} to obey same equilibrium conditions as chemical potential but to tend to \(y_{i}P\) in infinite dilution
\begin{equation*}
  \bar{f}_i(y_{i},T,P) = P^{\circ} \exp \left [ (\mu_i(y_i,T,P) - \mu_i^\circ(T))/ k_B T \right ]
\end{equation*}
\item Chemical potential \(\mu_i(y_i,T,P) = \mu_i^\circ(T) + k_B T \ln \left ( /P^\circ \right)\)
\item Fugacity coefficient \(\phi_{i}(y_{i,T,P})=\bar{f}_{i}(y_{i},T,P)/(y_{i}P)\)
\item Fugacity can be computed from a mixture-explicit EOS
\begin{equation*}
	    R T \ln \left ( \bar{f}_i/y_i P \right ) = \int_0^P \left (
      \bar{v}_i - \frac{RT}{P} \right ) dP  =  \frac{1}{RT} \left ( \frac{\partial (F - F^\text{ig})}{\partial N_i} \right )_{T,V,N_{j\neq i}} - \ln Z
 \end{equation*}
\item Virial mixture equation, vdW equation, \ldots
\item Lorentz-Berthelot mixing
\begin{equation*}
  b = \sum_i b_i \qquad a = \sum_i\sum_j y_i y_j a_{ij} \qquad a_{ij} = \sqrt{a_ia_j}
\end{equation*}
\item Lewis (ideal) fugacity rule \(\bar{f}_i \approx y_i f_i\) generalization of ideal gas
\end{enumerate}
\subsubsection{Ideal liquid mixtures}
\label{sec:orgc396362}
\begin{enumerate}
\item Lattice model with random distribution of molecules

\begin{equation*}
\Delta u_\text{mix} = \Delta v_\text{mix} = 0 \qquad \Delta s_\text{mix} = - k_B \sum_i x_i \ln x_i
\end{equation*}
\begin{equation*}
\mu_i(x_i,T) = \mu_i^\circ(T) + k_B T \ln \left ( x_i \right)
\end{equation*}

\item True for liquids of comparable molecular dimensions and interactions
\end{enumerate}
\subsubsection{Partial molar quantities}
\label{sec:org5ec691c}
\begin{enumerate}
\item For any extensive quantity or susceptibility, \(J\):
     \begin{equation*}
\bar{J}_i = \left ( \frac{\partial J}{\partial N_i} \right )_{N_{j\neq i}}
     \qquad J = \sum_i \bar{J}_i N_i \qquad j = \sum \bar{J}_i x_i
     \end{equation*}
\begin{equation*}
\Delta j_\text{mix} = \sum_i \bar{J}_ix_i - \sum_i j_i x_i
\end{equation*}
\item Gibbs-Duhem says partial molar properties are not independent: \(\sum_i N_i d\bar{J}_i = 0\)
\end{enumerate}

\subsubsection{Non-ideal liquid mixtures}
\label{sec:org9a0d3d0}
\begin{enumerate}
\item Bragg-Williams/mean field approximation
\item Differential exchange parameter \(\chi_{AB}\)

\begin{equation*}
   \chi_{12} = \frac{z}{k_BT}\left ( u_{12} - \frac{u_\text{11} +
    u_\text{22}}{2} \right )
\end{equation*}

\item Hildebrand regular solution and excess mixing quantities
\begin{equation*}
   \Delta g_\text{xs}/k_BT = \chi_{12} x_1(1-x_2)
\end{equation*}
\begin{equation*}
    \mu_1(T,x_1) = \mu_1^\text{ideal}(T,x_1) + k_B T \chi_{12} (1-x_1)^2
\end{equation*}
\item Activity and activity coefficient
\begin{enumerate}
\item Solvent convention
\item Solute convention
\end{enumerate}
\item Liquid-liquid phase diagrams
\begin{enumerate}
\item Phase separation, critical point
\end{enumerate}
\item Freezing point depression/boiling point elevation
\end{enumerate}
\subsubsection{Ionic mixtures}
\label{sec:orge4ecd9e}
\begin{enumerate}
\item Debye-Huckel
\end{enumerate}

\subsection{Gas-liquid equilibria}
\label{sec:org9fa2c82}
\subsubsection{Ideal-ideal liquid-vapor mixtures}
\label{sec:org4117db9}
\begin{enumerate}
\item Equal chemical potentials in each phase
\item Equilibrium cycle (relate to single component phase equilibrium): start from single component l-v equilibrium, compress each component to desired pressure, then mix.
\item Gas compression important, liquid compression (Poynting correction) less so.
\item Ideal vapor-liquid equilibrium \(\rightarrow\) Raoult's Law:
\begin{equation*}
  \mu_i^\text{gas} = \mu_i^\text{liq} \rightarrow y_i P = x_i P_i^*
\end{equation*}
\item Pressure-composition diagram
\item Temperature-composition diagram
\end{enumerate}

\subsubsection{Non-ideal liquid/ideal vapor}
\label{sec:orgd0ab762}
\begin{enumerate}
\item Regular solution
   \begin{equation*}
  \chi_{12} \left \{
   \begin{array}{rl}
     > 0 & \text{positive deviation from Raoult's Law,}\\
     = 0 & \text{Raoult's Law,}\\
     <0 & \text{negative deviation from Raoult's Law}
    \end{array} \right .
\end{equation*}
\item Temperature-composition diagrams
\begin{enumerate}
\item Liquid-vapor
\item Eutectics, \ldots{}
\end{enumerate}
\item Henry's Law (dilute) limit
\item Gibbs-Duhem consequences
\end{enumerate}


\section{Thermodynamics of Change}
\label{sec:orge8b7838}
